#введите два числа и определите какое больше

# a = int (input ('ввелите первое число целое = '))
# b = int (input ('ввелите второе число целое = '))

# r = 5.999
# print (-5//3)
# print(int (5.999))
# print(round(5.50,3))

# if a > b: a == b a <= b

# print(3<5)
# print(4+(3<5))
# print(x*(x%3==0))

# h = 18
# print (['yes', 'no'] [h%3!=0])


# ввести два числа и определить какое больше

# a = int(input('введите первое число целое = '))
# b = int(input('введите второе число целое = '))
# r = 5.999
# print(-5//3) 
# print(int(5.999))
# print(round(5.50,3))
# if a > b: a == b a <= b
# h= 18
# print(['да', 'NO'][h%3!=0])
# print(max(1,5,7))

# Задача 1. За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров?
# Нельзя использовать иф и циклы. 
# Input:
# n = 700
# m = 750
# Output: 2

# import math
# n = int (input ('введите сколько проезжает = '))
# m = int (input('введите длину маршрута = '))
# print -(-n//m)

# m = 750
# n = 700
# print (-(-m//n))
# print((m+n-1)//n)
# print(m//n+(m%n !=0))





n1 = int(input('Введите кол-во учеников в 1 классе: '))
n2 = int(input('Введите кол-во учеников в 2 классе: '))
n3 = int(input('Введите кол-во учеников в 3 классе: '))
print((n1//2 + n1%2!=0) + abs((-n2//2)) + ((n3+1)//2))